//----------------------------------------------------------------------------------------------
// подключаем библиотеки
//----------------------------------------------------------------------------------------------
#include "main.h"

//----------------------------------------------------------------------------------------------
// Здесь располагаем основной код программы
//----------------------------------------------------------------------------------------------
int main(){
                
		SysTick_Config(SystemCoreClock/1000);		// Инициализируем системный таймер 1ms 
		gpio_ini();															// Инициализируем порты ввода/вывода
		LED_OFF;																// выключаем светодиод
	
		while(1)
    {
			LED_ON;																// включаем светодиод
			delay_ms(DELAY);											// задержка
			LED_OFF;															// выключаем светодиод
			delay_ms(DELAY);											// задержка
		}
}
