//----------------------------------------------------------------------------------------------
// подключаем библиотеки
//----------------------------------------------------------------------------------------------
#include "main.h"

//----------------------------------------------------------------------------------------------
// «десь располагаем основной код программы
//----------------------------------------------------------------------------------------------
int main(){
                
		SysTick_Config(SystemCoreClock/1000);		// »нициализируем системный таймер 1ms 
		gpio_ini();															// »нициализируем порты ввода/вывода
	
		while(1)
    {
			LED_ON;																// включаем светодиод
			delay_ms(DELAY);											// задержка
			LED_OFF;															// выключаем светодиод
			delay_ms(DELAY);											// задержка
		}
}
