#ifndef __MAIN_H
#define __MAIN_H

//----------------------------------------------------------------------------------------------
// подключаем библиотеки
//----------------------------------------------------------------------------------------------
#include "stm32f10x.h"

#include "mcu_ini.h"
#include "delay.h"

//----------------------------------------------------------------------------------------------
// объ€вл€ем дефайны
//----------------------------------------------------------------------------------------------
#define LED_ON		GPIO_SetBits(PORTC, LED);			// ”станавливаем лог 1(т.е. +5в) на выводе
#define LED_OFF		GPIO_ResetBits(PORTC, LED);		// —брасываем лог 1(т.е. 0в) на выводе

#endif // __MAIN_H
