#ifndef __MAIN_H
#define __MAIN_H

//----------------------------------------------------------------------------------------------
// подключаем библиотеки
//----------------------------------------------------------------------------------------------
#include "stm32f10x.h"

#include "mcu_ini.h"
#include "delay.h"

//----------------------------------------------------------------------------------------------
// объявляем дефайны
//----------------------------------------------------------------------------------------------
// так как диод на плате подключен к +3,3в 
// то выключен он когда на выводе PC13 +3,3в
// а включен когда на выводе PC13 0
#define LED_OFF		GPIO_SetBits(PORTC, LED);			// Устанавливаем лог 1(т.е. +3,3в) на выводе
#define LED_ON		GPIO_ResetBits(PORTC, LED);		// Сбрасываем лог 1(т.е. 0в) на выводе

#endif // __MAIN_H
